SetThermalProperties Method
 Sets the thermal properties for the given FamilySymbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetThermalProperties(
	FamilyThermalProperties thermalProperties
)
Visual Basic
Public Sub SetThermalProperties ( _
	thermalProperties As FamilyThermalProperties _
)
Visual C++
public:
void SetThermalProperties(
	FamilyThermalProperties^ thermalProperties
)
Parameters
thermalProperties
Type: Autodesk.Revit.DBFamilyThermalProperties
 The new thermal properties. If a null reference (Nothing in Visual Basic), this unsets custom thermal properties for this FamilySymbol.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  The thermal properties are not valid for assignment.
Autodesk.Revit.ExceptionsInvalidOperationException |  This FamilySymbol does not contain thermal properties.
See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →